app/controllers/lists_controller.rb

  def show
    @products = Product.where(list_id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."list_id" = ?  [["list_id", 1]]

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Gregory"], ["description", "Gregory"], ["created_at", "2016-04-03 01:46:01.727200"], ["updated_at", "2016-04-03 01:46:01.727200"]]

  def update
    respond_to do |format|
      if @list.update(list_params)
---
UPDATE "lists" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "School Supplies"], ["description", "Notebooks, Pen, Paper"], ["updated_at", "2016-04-04 16:57:27.036034"], ["id", 3]]

  def destroy

    @list.destroy
---
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 3]]