app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "quanity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "egg"], ["description", "organic from farm"], ["quanity", "2"], ["price", 2.0], ["created_at", "2016-04-03 03:04:52.512204"], ["updated_at", "2016-04-03 03:04:52.512204"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 0.0], ["updated_at", "2016-04-04 16:58:38.995492"], ["id", 2]]